__________________________________________________________________________________________________
Layer (type)                    Output Shape         Param #     Connected to                     
==================================================================================================
3D_Encoder_input (InputLayer)   (None, 32, 32, 32, 1 0                                            
__________________________________________________________________________________________________
2D_Encoder_input (InputLayer)   (None, 32, 32, 1)    0                                            
__________________________________________________________________________________________________
3D_conv1_1 (Conv3D)             (None, 32, 32, 32, 8 224         3D_Encoder_input[0][0]           
__________________________________________________________________________________________________
2D_conv1_1 (Conv2D)             (None, 32, 32, 8)    80          2D_Encoder_input[0][0]           
__________________________________________________________________________________________________
3D_conv1_2 (Conv3D)             (None, 32, 32, 32, 8 1736        3D_conv1_1[0][0]                 
__________________________________________________________________________________________________
2D_conv1_2 (Conv2D)             (None, 32, 32, 8)    584         2D_conv1_1[0][0]                 
__________________________________________________________________________________________________
3d_pool_1 (MaxPooling3D)        (None, 16, 16, 16, 8 0           3D_conv1_2[0][0]                 
__________________________________________________________________________________________________
2d_pool_1 (MaxPooling2D)        (None, 16, 16, 8)    0           2D_conv1_2[0][0]                 
__________________________________________________________________________________________________
3D_conv2_1 (Conv3D)             (None, 16, 16, 16, 1 3472        3d_pool_1[0][0]                  
__________________________________________________________________________________________________
2D_conv2_1 (Conv2D)             (None, 16, 16, 16)   1168        2d_pool_1[0][0]                  
__________________________________________________________________________________________________
3D_conv2_2 (Conv3D)             (None, 16, 16, 16, 1 6928        3D_conv2_1[0][0]                 
__________________________________________________________________________________________________
2D_conv2_2 (Conv2D)             (None, 16, 16, 16)   2320        2D_conv2_1[0][0]                 
__________________________________________________________________________________________________
3d_pool_2 (MaxPooling3D)        (None, 8, 8, 8, 16)  0           3D_conv2_2[0][0]                 
__________________________________________________________________________________________________
2d_pool_2 (MaxPooling2D)        (None, 8, 8, 16)     0           2D_conv2_2[0][0]                 
__________________________________________________________________________________________________
3D_conv3_1 (Conv3D)             (None, 8, 8, 8, 32)  13856       3d_pool_2[0][0]                  
__________________________________________________________________________________________________
2D_conv3_1 (Conv2D)             (None, 8, 8, 32)     4640        2d_pool_2[0][0]                  
__________________________________________________________________________________________________
3D_conv3_2 (Conv3D)             (None, 8, 8, 8, 32)  27680       3D_conv3_1[0][0]                 
__________________________________________________________________________________________________
2D_conv3_2 (Conv2D)             (None, 8, 8, 32)     9248        2D_conv3_1[0][0]                 
__________________________________________________________________________________________________
3d_pool_3 (MaxPooling3D)        (None, 4, 4, 4, 32)  0           3D_conv3_2[0][0]                 
__________________________________________________________________________________________________
2d_pool_3 (MaxPooling2D)        (None, 4, 4, 32)     0           2D_conv3_2[0][0]                 
__________________________________________________________________________________________________
3D_conv4_1 (Conv3D)             (None, 4, 4, 4, 64)  55360       3d_pool_3[0][0]                  
__________________________________________________________________________________________________
2D_conv4_1 (Conv2D)             (None, 4, 4, 64)     18496       2d_pool_3[0][0]                  
__________________________________________________________________________________________________
3D_conv4_2 (Conv3D)             (None, 4, 4, 4, 64)  110656      3D_conv4_1[0][0]                 
__________________________________________________________________________________________________
2D_conv4_2 (Conv2D)             (None, 4, 4, 64)     36928       2D_conv4_1[0][0]                 
__________________________________________________________________________________________________
3d_flatten (Flatten)            (None, 4096)         0           3D_conv4_2[0][0]                 
__________________________________________________________________________________________________
2d_flatten (Flatten)            (None, 1024)         0           2D_conv4_2[0][0]                 
__________________________________________________________________________________________________
3d_dense_1 (Dense)              (None, 256)          1048832     3d_flatten[0][0]                 
__________________________________________________________________________________________________
2d_dense_1 (Dense)              (None, 256)          262400      2d_flatten[0][0]                 
__________________________________________________________________________________________________
3d_dense_2 (Dense)              (None, 32)           8224        3d_dense_1[0][0]                 
__________________________________________________________________________________________________
2d_dense_2 (Dense)              (None, 32)           8224        2d_dense_1[0][0]                 
__________________________________________________________________________________________________
input_concat (Concatenate)      (None, 64)           0           3d_dense_2[0][0]                 
                                                                 2d_dense_2[0][0]                 
__________________________________________________________________________________________________
encoder_dense (Dense)           (None, 512)          33280       input_concat[0][0]               
__________________________________________________________________________________________________
mu (Dense)                      (None, 10)           5130        encoder_dense[0][0]              
__________________________________________________________________________________________________
sigma (Dense)                   (None, 10)           5130        encoder_dense[0][0]              
__________________________________________________________________________________________________
latent (Lambda)                 (None, 10)           0           mu[0][0]                         
                                                                 sigma[0][0]                      
__________________________________________________________________________________________________
latent_concat (Concatenate)     (None, 42)           0           latent[0][0]                     
                                                                 2d_dense_2[0][0]                 
__________________________________________________________________________________________________
dense_33 (Dense)                (None, 4096)         176128      latent_concat[0][0]              
__________________________________________________________________________________________________
reshape_33 (Reshape)            (None, 4, 4, 4, 64)  0           dense_33[0][0]                   
__________________________________________________________________________________________________
3D_conv5_1 (Conv3D)             (None, 4, 4, 4, 64)  110656      reshape_33[0][0]                 
__________________________________________________________________________________________________
3D_conv5_2 (Conv3D)             (None, 4, 4, 4, 64)  110656      3D_conv5_1[0][0]                 
__________________________________________________________________________________________________
3D_up1 (UpSampling3D)           (None, 8, 8, 8, 64)  0           3D_conv5_2[0][0]                 
__________________________________________________________________________________________________
3D_conv6_1 (Conv3D)             (None, 8, 8, 8, 32)  55328       3D_up1[0][0]                     
__________________________________________________________________________________________________
3D_conv6_2 (Conv3D)             (None, 8, 8, 8, 32)  27680       3D_conv6_1[0][0]                 
__________________________________________________________________________________________________
3D_up2 (UpSampling3D)           (None, 16, 16, 16, 3 0           3D_conv6_2[0][0]                 
__________________________________________________________________________________________________
3D_conv7_1 (Conv3D)             (None, 16, 16, 16, 1 13840       3D_up2[0][0]                     
__________________________________________________________________________________________________
3D_conv7_2 (Conv3D)             (None, 16, 16, 16, 1 6928        3D_conv7_1[0][0]                 
__________________________________________________________________________________________________
3D_up3 (UpSampling3D)           (None, 32, 32, 32, 1 0           3D_conv7_2[0][0]                 
__________________________________________________________________________________________________
3D_conv8_1 (Conv3D)             (None, 32, 32, 32, 8 3464        3D_up3[0][0]                     
__________________________________________________________________________________________________
3D_conv8_2 (Conv3D)             (None, 32, 32, 32, 8 1736        3D_conv8_1[0][0]                 
__________________________________________________________________________________________________
3D_conv8_3 (Conv3D)             (None, 32, 32, 32, 2 434         3D_conv8_2[0][0]                 
__________________________________________________________________________________________________
3D_conv_output (Conv3D)         (None, 32, 32, 32, 1 55          3D_conv8_3[0][0]                 
==================================================================================================
Total params: 2,171,501
Trainable params: 2,171,501
Non-trainable params: 0
__________________________________________________________________________________________________
